{
  "pageTitle": "队长和队委寄语",
  "pageSubtitle": "天津大学国旗护卫队第28届队长与队委的深情嘱托与殷切期望",
  "stats": {
    "totalMessages": 24,
    "categories": 5,
    "generations": 28
  },
  "categories": [
    { "id": "all", "name": "全部寄语", "icon": "fa-star" },
    { "id": "captain", "name": "队长寄语", "icon": "fa-crown" },
    { "id": "committee", "name": "队委寄语", "icon": "fa-users" },
    { "id": "trainer", "name": "训练员组", "icon": "fa-dumbbell" },
    { "id": "member", "name": "优秀队员", "icon": "fa-user-friends" }
  ],
  "messages": [
    {
      "id": 1,
      "name": "张队长",
      "position": "国旗护卫队队长",
      "avatar": "../images/captain.jpg",
      "categories": ["captain"],
      "roles": ["队长", "总指挥", "第28届"],
      "isCaptain": true,
      "date": "2025年12月25日",
      "excerpt": "亲爱的第28届预备队员们：看到你们从初入队伍的稚嫩，到现在动作整齐划一、眼神坚毅，我由衷地为你们感到骄傲。国旗护卫队的训练是艰苦的，但守护国旗的荣誉是无价的。",
      "quote": "每一次升旗都是对心灵的一次洗礼，每一次训练都是对意志的一次磨砺。希望你们将国旗精神融入血液，成为真正的国旗守护者。",
      "fullMessage": [
        "亲爱的28届预备队员们：",
        "作为国旗护卫队队长，我有幸见证了你们的成长与进步。从最初的生涩到现在的逐渐成熟，你们用实际行动诠释了'不怕苦、不怕累'的国护精神。",
        "国旗不仅是一面旗帜，更是一种精神的象征。守护国旗就是守护我们的信仰和荣誉。在训练中，我看到你们在烈日下坚持军姿，在寒风中练习齐步。每一次汗水的流淌，每一次肌肉的酸痛，都是成长的印记。",
        "记住，国旗护卫队的使命不仅仅是升旗护旗，更是要将这种严谨、自律、奉献的精神带到学习和生活的方方面面。希望你们能够将在这里学到的品质，转化为未来发展的动力。",
        "前方的路还很长，训练的任务还很重。但我相信，只要你们保持初心，坚持不懈，一定能够成为合格的国旗守护者，为天津大学国旗护卫队增添新的荣耀！",
        "愿你们在国旗护卫队的每一天都有所收获，愿国旗精神永远指引你们前行！"
      ]
    },
    {
      "id": 2,
      "name": "李副队长",
      "position": "国旗护卫队副队长",
      "avatar": "../images/vice-captain.jpg",
      "categories": ["captain"],
      "roles": ["副队长", "训练负责人", "第28届"],
      "date": "2025年12月26日",
      "excerpt": "各位队员：一个学期的训练即将结束，我看到了你们的成长与蜕变。从最初的生疏到现在的默契配合，每一次进步都让我感动。训练的意义不仅在于动作的标准，更在于内心的淬炼。",
      "highlight": "纪律是队伍的基石，团结是力量源泉。愿你们在未来的日子里，继续保持这份热情与坚持。",
      "fullMessage": [
        "各位队员：",
        "作为副队长和训练负责人，我与你们一同度过了这个学期的训练时光。看到你们从最初的生疏到现在的默契配合，每一次进步都让我感动。",
        "训练的意义不仅在于动作的标准，更在于内心的淬炼。纪律是队伍的基石，团结是力量源泉。在国护队，我们不仅学习如何走齐步、站军姿，更重要的是学习如何成为一个有担当、有责任感的人。",
        "每一次训练，都是对自我的挑战；每一次坚持，都是对意志的磨砺。希望你们能将国护精神带到学习和生活中，无论遇到什么困难，都能保持这份坚韧不拔的毅力。",
        "愿你们在未来的日子里，继续保持这份热情与坚持，成为更好的自己，为国旗护卫队贡献自己的力量！"
      ]
    },
    {
      "id": 3,
      "name": "王训练委员",
      "position": "训练委员",
      "avatar": "../images/training-leader.jpg",
      "categories": ["trainer", "committee"],
      "roles": ["训练员组组长", "动作教官", "第27届"],
      "date": "2025年12月27日",
      "excerpt": "致全体队员：作为训练委员，我见证了你们每一个动作的进步。从军姿的挺拔到齐步的整齐，每一次汗水的付出都值得肯定。训练中，我看到过你们的疲惫，也看到过你们的坚持。",
      "quote": "训练场上流下的每一滴汗水，都会在升旗仪式上化作最耀眼的光芒。坚持到底，你就是最棒的！",
      "fullMessage": [
        "致全体队员：",
        "作为训练委员，我有幸见证了你们每一个动作的进步。从最初的军姿不够挺拔，到现在每个人的身姿都如松树般笔直；从齐步走的不协调，到现在的整齐划一，每一次进步都是你们汗水的结晶。",
        "训练场上流下的每一滴汗水，都会在升旗仪式上化作最耀眼的光芒。我见过你们在烈日下的坚持，见过你们在寒风中的努力，更见过你们相互帮助、共同进步的团结精神。",
        "记住，标准不仅仅在训练场，更在生活的每一个细节。让国护精神成为你们的一部分，让'爱校护旗，奉献真心'这八个字真正融入你们的大学生活。",
        "继续努力，坚持到底，你们每个人都是最棒的！"
      ]
    },
    {
      "id": 4,
      "name": "赵组织委员",
      "position": "组织委员",
      "avatar": "../images/organization-leader.jpg",
      "categories": ["committee"],
      "roles": ["组织委员", "活动策划", "第27届"],
      "date": "2025年12月28日",
      "excerpt": "亲爱的队友们：从见面会到结训晚会，我们一起走过了这个学期的点点滴滴。每一次活动的顺利开展，都离不开你们的积极参与和配合。",
      "highlight": "国旗护卫队是一个整体，每个人的付出都至关重要。愿我们继续携手，共同创造更多难忘的回忆。",
      "fullMessage": [
        "亲爱的队友们：",
        "作为组织委员，我与你们一同走过了这个学期的点点滴滴。从最初的见面会到结训晚会，每一次活动的顺利开展，都离不开你们的积极参与和配合。",
        "国旗护卫队不仅是一个严肃的训练队伍，更是一个温暖的大家庭。在这里，我们不仅学习升旗护旗的技能，更学会了团结协作、互帮互助的精神。",
        "每一次活动的背后，都是大家共同努力的结果。无论是训练中的相互纠正，还是活动中的默契配合，都让我看到了你们的成长和进步。",
        "愿我们继续携手，共同创造更多难忘的回忆。愿国旗护卫队的精神在我们每个人心中生根发芽，成为我们大学生活中最宝贵的财富。"
      ]
    },
    {
      "id": 5,
      "name": "孙宣传委员",
      "position": "宣传委员",
      "avatar": "../images/propaganda-leader.jpg",
      "categories": ["committee"],
      "roles": ["宣传委员", "摄影负责人", "第27届"],
      "date": "2025年12月29日",
      "excerpt": "各位队员：每一次训练、每一次升旗、每一次活动，我都用镜头记录下你们的成长与风采。宣传不仅是记录，更是传承。",
      "quote": "希望通过我们的镜头和文字，让更多人了解国旗护卫队，感受到这份荣誉与责任。你们的每一次努力都值得被看见！",
      "fullMessage": [
        "各位队员：",
        "作为宣传委员，我有幸用镜头记录下你们的每一次训练、每一次升旗、每一次活动的精彩瞬间。从最初的青涩到现在的自信从容，你们的成长与风采都被一一记录。",
        "宣传不仅是记录，更是传承。希望通过我们的镜头和文字，让更多人了解国旗护卫队，感受到这份荣誉与责任。你们的每一次努力都值得被看见，每一次进步都值得被铭记。",
        "在未来的日子里，我会继续用镜头捕捉你们的精彩瞬间，用文字记录你们的成长故事。希望这些记录能成为你们大学生活中最珍贵的回忆。",
        "继续努力，让国旗护卫队的精神通过我们的宣传传递给更多的人！"
      ]
    },
    {
      "id": 6,
      "name": "周教官",
      "position": "训练员组副组长",
      "avatar": "../images/trainer1.jpg",
      "categories": ["trainer"],
      "roles": ["训练教官", "军姿指导", "第27届"],
      "date": "2025年12月30日",
      "excerpt": "训练场上，我看到的是你们坚毅的眼神和挺拔的身姿。每一次的坚持，都是对自我的超越。记住，标准不仅仅在训练场，更在生活的每一个细节。",
      "highlight": "让国护精神成为你们的一部分，让'爱校护旗，奉献真心'这八个字真正融入你们的大学生活。",
      "fullMessage": [
        "训练场上，我看到的是你们坚毅的眼神和挺拔的身姿。每一次的坚持，都是对自我的超越。",
        "作为训练教官，我深知训练的辛苦。但我也看到了你们的努力和进步。从最初的军姿不稳，到现在的挺拔如松；从齐步走的混乱，到现在的整齐划一，每一次进步都是你们汗水的结晶。",
        "记住，标准不仅仅在训练场，更在生活的每一个细节。让国护精神成为你们的一部分，让'爱校护旗，奉献真心'这八个字真正融入你们的大学生活。",
        "训练虽然辛苦，但收获的不仅仅是技能，更是意志的磨砺和品格的塑造。希望你们能将这种精神带到学习和生活中，成为更好的自己。",
        "继续坚持，你们都是最棒的！"
      ]
    },
    {
      "id": 7,
      "name": "陈队员",
      "position": "优秀队员代表",
      "avatar": "../images/member1.jpg",
      "categories": ["member"],
      "roles": ["升旗手", "第28届", "训练标兵"],
      "date": "2025年12月31日",
      "excerpt": "作为新队员代表，我想说：加入国旗护卫队是我大学生涯最正确的选择。在这里我不仅学会了纪律和坚持，更收获了珍贵的友谊和成长。",
      "quote": "每一次迎着朝阳升起国旗，心中都充满无限的自豪与感动。这种体验，只有真正站在国旗下才能深刻体会。",
      "fullMessage": [
        "作为新队员代表，我想说：加入国旗护卫队是我大学生涯最正确的选择。",
        "在这里，我不仅学会了纪律和坚持，更收获了珍贵的友谊和成长。从最初的陌生到现在的熟悉，从最初的紧张到现在的从容，每一步都离不开学长学姐的指导和队友们的帮助。",
        "每一次迎着朝阳升起国旗，心中都充满无限的自豪与感动。这种体验，只有真正站在国旗下才能深刻体会。",
        "训练虽然辛苦，但当我们一起喊着口号，一起迈着整齐的步伐时，那种团结一致的感觉让我深深感动。在这里，我不仅学会了技能，更学会了责任和担当。",
        "感谢国旗护卫队给了我这样一个平台，让我有机会成长和进步。我会继续努力，不辜负大家的期望！"
      ]
    }
  ]
}